app/Controllers/Admin/BlogsController.php

SELECT *
FROM `blogs`
ORDER BY `published_on` DESC
---
    public function blogs()
    {
        $model = new BlogsModel();

        $data = $model->orderBy('published_on', 'DESC')->findAll();

SELECT *
FROM `blogs`
WHERE `blogs`.`id` = '13'
---
    public function edit($id)
    {
        $model = new BlogsModel();
        $blog = $model->find($id);

SELECT *
FROM `blogs`
WHERE `b_slug` = 'car-dashboard-polish-newtown'
 LIMIT 1
SELECT *
FROM `blogs`
WHERE `id` != '9'
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function view($slug)
    {
        $model = new BlogsModel();
        $blog = $model->where('b_slug', $slug)->first();

        if (!$blog) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Blog not found");
        }

        $blgg = $model->where('id !=', $blog['id'])->orderBy('created_at', 'DESC')->findAll(5);