app/Controllers/Admin/BrandsController.php

                }
                $image->withFile($logoFile)->save('uploads/brands/' . $tourFileName, 70);

                $result = $brandModel->save([
                    'logo' => $tourFileName,
                    'name' => $this->request->getPost('name'),
                    'slug' => $checkSlug,
                ]);
---
INSERT INTO `brands` (`logo`, `name`, `slug`, `created_at`, `updated_at`) VALUES ('Brand-1765445999.png', 'Pabitra  Azaz', 'pabitra-azaz', '2025-12-11 09:39:59', '2025-12-11 09:39:59')