app/Controllers/Home.php

    public function index()
    {
        $model = new BlogsModel();
        $data = $model->findAll();
---
SELECT *
FROM `blogs`

    public function blogs()
    {
        $model = new BlogsModel();
        $data = $model->orderBy('published_on', 'DESC')->findAll();
---
SELECT *
FROM `blogs`
ORDER BY `published_on` DESC