app/Models/BrandsModel.php

    public function checkSlug($slug)
    {
        $baseSlug = $slug;  // store the original slug
        $count = 1;

        // Check if slug already exists
        while ($this->where('slug', $slug)->first()) {
---
SELECT *
FROM `brands`
WHERE `slug` = 'pabitra-azaz'
 LIMIT 1